<!-- dflook/terraform-github-actions {"workspace":"multi-arch-base","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"5f89d70d375d60850dcaf4a7045373c327793701b9370b8b980983c229644a48","plan_job_ref":"Job Test plan target and replace #324 at https://github.com/dflook/terraform-github-actions/actions/runs/4336662943","plan_hash":"4a880ad7977f751095aa1a8dc804bcb58822481b18940ee0a19c0b9bc9aac8b7","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __multi-arch-base__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "fzrfOCpcnD" -> (known after apply)
  ~ foreach = "zW4kVmaOmZ" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #324](https://github.com/dflook/terraform-github-actions/actions/runs/4336662943)